import React from 'react'
import { withLayout } from '@/layout'
import { Divider, Typography } from '@mui/material'
import PageHead from '@/components/PageHead'

const Contacts = () => {
  return (
    <>
      <PageHead title="Контакты" />
      <Typography variant="h3">Контактная страница</Typography>
      <Divider sx={{ marginBottom: '40px' }} />
      <Typography>
        Еу лаореет цивибус вел, мел ад еррор ехпетенда. Аугуе диспутатиони меа
        но. Яуи цлита цонсеяуат адверсариум ех. Хас нибх убияуе ат, яуи долорем
        граецис аппеллантур не, сит зрил луцилиус пхилосопхиа те. Еос видиссе
        цонсулату ан. Ех алтерум фацилисис персецути яуо, меи дуис еуисмод
        сенсибус те, ан стет доцтус фацилисис нам. Хас но малуиссет инструцтиор,
        ат омнесяуе ирацундиа при. Ид пурто волуптариа сед, иуварет саперет ад
        еам, еу доминг легимус вих. Ид феугиат сцрипторем сцрибентур еум, алии
        диспутатиони нец ид. Ет яуо либрис фацилис волуптуа, яуо фацер ехплицари
        цу. Ад про суммо омнес еффициенди, еос ад виде делецтус. Лабитур
        постулант мнесарчум еос еи. Те виде утамур цоммуне нам. Еу лаореет
        цивибус вел, мел ад еррор ехпетенда. Аугуе диспутатиони меа но. Яуи
        цлита цонсеяуат адверсариум ех. Хас нибх убияуе ат, яуи долорем граецис
        аппеллантур не, сит зрил луцилиус пхилосопхиа те. Еос видиссе цонсулату
        ан. Ех алтерум фацилисис персецути яуо, меи дуис еуисмод сенсибус те, ан
        стет доцтус фацилисис нам. Хас но малуиссет инструцтиор, ат омнесяуе
        ирацундиа при. Ид пурто волуптариа сед, иуварет саперет ад еам, еу
        доминг легимус вих. Ид феугиат сцрипторем сцрибентур еум, алии
        диспутатиони нец ид. Ет яуо либрис фацилис волуптуа, яуо фацер ехплицари
        цу. Ад про суммо омнес еффициенди, еос ад виде делецтус. Лабитур
        постулант мнесарчум еос еи. Те виде утамур цоммуне нам.
      </Typography>
    </>
  )
}

export default withLayout(Contacts)
