import { withLayout } from '@/layout'
import SearchComponent from '@/components/Search'
import { Typography } from '@mui/material'
import PageHead from '@/components/PageHead'

function Home() {
  return (
    <>
      <PageHead title="Скидки - найди дешевле!">
        <meta name="viewport" content="width=device-width, initial-scale=1" />
        <link rel="icon" href="/favicon.ico" />
      </PageHead>
      <SearchComponent />
      <Typography variant="h3">Домашняя страница</Typography>
      <Typography>
        Лорем ипсум долор сит амет, сеа агам доминг еи, ат цум сумо игнота
        еирмод. Еу тота елояуентиам сит, вих ет фацер плацерат сигниферумяуе.
        Идяуе иусто детерруиссет не еам, при ин яуот еррорибус реферрентур. Еам
        ностер саперет легендос ан, не вим легере интерессет. Тациматес платонем
        ин вим. Модо фугит фалли яуи ут, вел нонумы адолесценс либерависсе ин.
        Феугаит омиттам патриояуе вих ин, еум цонвенире дефиниебас цонституам
        ин. Ирацундиа дефинитионес ет меи. Ат елит дицам ехпетендис нам, велит
        цонсеяуат ан вис, еи нец ессе апериам праесент. Еам суас ехерци не, ех
        еос поссе еяуидем дефинитионем. Лаборес плацерат ин ест, модус еяуидем
        те цум, цум еррорибус маиестатис еу. Магна реяуе волуптатибус яуо те. Еу
        про праесент ехпетенда интеллегам. Ех дицунт пхаедрум нам, нец не
        еррорибус репримияуе диссентиет, велит долорум инцидеринт еу сед. Еи
        малорум диссентиунт еос, мел ад аугуе луптатум тациматес. Те при тамяуам
        фацилиси. Еу алтерум еуисмод вивендо пер. Примис перпетуа дуо ех. Велит
        опортеат ехплицари ат цум, еи пер лорем етиам яуандо, граеце постеа ех
        нам. Елигенди аццусата еос ид. Нострум десеруиссе витуператорибус вим
        ет, атяуи персецути сеа еи. Меа маиестатис диссентиас не, еа юсто
        диссентиет яуо. Ин темпор епицури меи, яуот цивибус но еум. Прима
        десеруиссе но вим, ин хис инани перфецто. Еа еам детрахит урбанитас,
        нихил долор цотидиеяуе еам ан. Деленити праесент яуо но, нисл праесент
        еос ин. Нумяуам минимум еа дуо, ут ассум веритус инцидеринт яуи. Сеа еу
        нулла реферрентур. Цу веро иллум облияуе нам, ат вис легимус аццусам. Ан
        иус ессент лобортис салутатус, сед поссим лобортис цонвенире ут. Яуи
        сцаевола цонтентионес ад, хабео дицат инцидеринт мел ид, цум еу тритани
        дебитис. Чоро губергрен еам ет, цлита евертитур цу сеа. Неморе апеириан
        елецтрам пер еи, ин еос дицта феугаит детерруиссет, ан омнес пертинах
        детерруиссет вис. Еи пер адмодум сенсибус. Нец елояуентиам цомпрехенсам
        те. Ат натум лаудем алияуандо при. Хас апеириан мнесарчум аппеллантур
        ид. Еу лаореет цивибус вел, мел ад еррор ехпетенда. Аугуе диспутатиони
        меа но. Яуи цлита цонсеяуат адверсариум ех. Хас нибх убияуе ат, яуи
        долорем граецис аппеллантур не, сит зрил луцилиус пхилосопхиа те. Еос
        видиссе цонсулату ан. Ех алтерум фацилисис персецути яуо, меи дуис
        еуисмод сенсибус те, ан стет доцтус фацилисис нам. Хас но малуиссет
        инструцтиор, ат омнесяуе ирацундиа при. Ид пурто волуптариа сед, иуварет
        саперет ад еам, еу доминг легимус вих. Ид феугиат сцрипторем сцрибентур
        еум, алии диспутатиони нец ид. Ет яуо либрис фацилис волуптуа, яуо фацер
        ехплицари цу. Ад про суммо омнес еффициенди, еос ад виде делецтус.
        Лабитур постулант мнесарчум еос еи. Те виде утамур цоммуне нам.
      </Typography>
    </>
  )
}

export default withLayout(Home)
